app/views/locals/destroy.js.erb

$('.destroy-local').bind('ajax:success', function() {
   $(this).closest('li').fadeOut();
});
---
DELETE FROM `locals` WHERE `locals`.`id` = 7