app/views/citizens/destroy.js.erb

DELETE FROM `citizens` WHERE `citizens`.`id` = 1
---
$('.destroy-citizen').bind('ajax:success', function() {
   $(this).closest('tr').fadeOut();
});