app/views/users/destroy.js.erb

$('.destroy-user').bind('ajax:success', function() {
   $(this).closest('li').fadeOut();
});
---
DELETE FROM `users` WHERE `users`.`id` = 2