app/helpers/sessions_helper.rb

	def current_user
		if session[:user_id]
			@current_user ||= User.find_by(id: session[:user_id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1