app/controllers/citizens_controller.rb

  def index
    @citizens = Citizen.all
---
SELECT `citizens`.* FROM `citizens`

  def create
    @citizen = Citizen.new(citizen_params)

    respond_to do |format|
      if @citizen.save
---
INSERT INTO `citizens` (`cmnd`, `name`, `birthday`, `sex`, `hometown`, `paddress`, `traddress`, `religion`, `edulevel`, `job`, `code`, `created_at`, `updated_at`) VALUES ('123253453656', 'datdo', '2001-01-21 00:00:00', 'Nam', 'Bac Ninh', 'Bac Ninh', 'Bac NInh', 'Phat giao', 'Dai hoc', 'IT', 22334455, '2021-12-17 04:27:24.946472', '2021-12-17 04:27:24.946472')

  def overall
    @count = Citizen.count
---
SELECT COUNT(*) FROM `citizens`

  def destroy
    Citizen.find(params[:id]).destroy
---
DELETE FROM `citizens` WHERE `citizens`.`id` = 1
SELECT `citizens`.* FROM `citizens` WHERE `citizens`.`id` = 1 LIMIT 1

  def detail
    @citizens = Citizen.all
---
SELECT `citizens`.* FROM `citizens`