app/controllers/locals_controller.rb

  def index
    @locals = Local.all
---
SELECT `locals`.* FROM `locals`

  def create
    @local = Local.new(local_params)

    respond_to do |format|
      if @local.save
---
INSERT INTO `locals` (`name`, `code`, `status`, `created_at`, `updated_at`) VALUES ('Bac Ninh', 12, 'Chua hoan thanh', '2021-12-18 08:04:09.781563', '2021-12-18 08:04:09.781563')

  def destroy
    Local.find(params[:id]).destroy
---
DELETE FROM `locals` WHERE `locals`.`id` = 7
SELECT `locals`.* FROM `locals` WHERE `locals`.`id` = 7 LIMIT 1