app/controllers/sessions_controller.rb

  def create
    user = User.find_by(accountname: params[:session][:accountname])
---
SELECT `users`.* FROM `users` WHERE `users`.`accountname` = 36 LIMIT 1