app/controllers/users_controller.rb

INSERT INTO `users` (`tk`, `accountname`, `region`, `permission`, `created_at`, `updated_at`, `password_digest`) VALUES ('A2', 36, 'Thanh Hoa', 'false', '2021-12-14 08:22:29.308996', '2021-12-14 08:22:29.308996', '$2a$12$1a/PPkU2KHQ/Url8Rda/w.sGeghy1xWFNejmpy6D7bu7NrA8IAvda')
---
  def create
    @user = User.new(user_params)
    if @user.save

DELETE FROM `users` WHERE `users`.`id` = 2
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
---
  def destroy
    User.find(params[:id]).destroy

SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
SELECT `users`.* FROM `users`
UPDATE `users` SET `users`.`permission` = 'false', `users`.`updated_at` = '2021-12-18 07:18:09.648983' WHERE `users`.`id` = 7
UPDATE `users` SET `users`.`permission` = 'true', `users`.`updated_at` = '2021-12-18 07:32:59.130430' WHERE `users`.`id` = 7
---
  def permission
    @user = User.find(params[:id])
    @users = User.all
    if (@user.permission == "true")
      @users.each do |user|
        code1 = @user.accountname.to_s
        code2 = user.accountname.to_s
        if (code2.index(code1) == 0)
          user.update_attribute(:permission, "false")
        end
      end

      flash[:success] = "Khóa quyền khai báo thành công"
    else

      @users.each do |user|
        code1 = @user.accountname.to_s
        code2 = user.accountname.to_s
        if (code2.index(code1) == 0)
          user.update_attribute(:permission, "true")